# MepZoneHotwaterLoop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MepZoneHotwaterLoop Property
ParameterTypeId Class See Also
---
"Heating Hot Water Loop"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MepZoneHotwaterLoop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MepZoneHotwaterLoop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MepZoneHotwaterLoop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace